var arrLang = {
	'ua': {
		'home': 'Головна',
		'about': 'Про нас',
		'product': 'Продукт',
		'partners': 'Партнерам',
		'contact': 'Контакти',
		'top_header_text1': 'Виготовлення',
		'top_header_text2': 'та встановлення',
		'top_header_text3': 'автономниx',
		'top_header_text4': 'каналізаційних cистем',
		'top_header_button': 'Дізнатися більше',
		'text_circle_1': 'рік заснування компанії',
		'text_circle_2': 'гарантії на товар',
		'text_circle_3': 'рівень очистки води',
        'text_circle_4': 'виробник в Україні',
        'need':'ПОТРІБЕН',
        'if':'якщо:',
        'list_1':'У Вас є дача, або заміський будинок;',
        'list_2':'Немає центральної каналізації;',
		'list_3_1':'Вам набридли проблеми з вигрібною ямою,',
		'list_3_2':' бетонними кільцями або вуличним туалетом;',
        'list_4':'Вам докучають постійний неприємний запах і комахи;',
        'list_5':'Ви втомилися викликати асенізаторську машину і витрачати на це свої кошти;',
        'list_6':'Ви хочете позбутися проблеми зі стоками вашого будинку раз і назавжди.',
        'haveAquestion':'Маєте питання?',
        'consult_1':'Наш консультант з радістю',
        'consult_2':'Вам допоможе!',
        'callback_1':'ЗАМОВИТИ ДЗВІНОК',
        'production':'Продукція',
        'production_text_1':'Сучасна каналізаційна система використовується насамперед для очищення побутових і близьких до них (за складом) стоків приміщень. Продукція ',
        'production_text_2':' має такі переваги:',
	},
	'ru': {
		'home': 'Главная',
		'about': 'О нас',
		'product': 'Продукт',
		'partners': 'Партнерам',
		'contact': 'Контакты',
		'top_header_text1': 'Изготовление',
		'top_header_text2': 'и установка',
		'top_header_text3': 'автономных',
		'top_header_text4': 'канализационных систем',
		'top_header_button': 'Узнать большее',
		'text_circle_1': 'год основания компании',
		'text_circle_2': 'гарантии на товар',
		'text_circle_3': 'уровень очистки воды',
        'text_circle_4': 'производитель в Украине',
        'need':'НУЖЕН',
        'if':'если:',
        'list_1':'У Вас есть дача или загородный дом;',
        'list_2':'Нет центральной канализации;',
        'list_3_1':'Вам надоели проблемы с выгребной ямой,',
		'list_3_2':' бетонными кольцами или уличным туалетом;',
		'list_4':'Вам досаждают постоянный неприятный запах и насекомые;',
        'list_5':'Вы устали вызвать ассенизаторскую машину и тратить на это свои средства;',
        'list_6':'Вы хотите избавиться от проблемы со стоками вашего дома раз и навсегда.',
        'haveAquestion':'Есть вопросы?',
        'consult_1':'Наш консультант с радостью',
        'consult_2':'Вам поможет!',
        'callback_1':'ЗАКАЗАТЬ ЗВОНОК',
        'production':'Продукция',
        'production_text_1':'Современная канализационная система используется прежде всего для очистки бытовых и близких к ним (по составу) стоков помещений. Продукция ',
        'production_text_2':' имеет следующие преимущества:',

	}
};
// Process translation
$(function () {
	$('.translate').click(function () {
		var lang = $(this).attr('id');

		$('.lang').each(function (index, item) {
			$(this).text(arrLang[lang][$(this).attr('key')]);
		});
	});
});